package niko.ru.ime;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;
import niko.ru.ime.model.Employee;
import niko.ru.ime.model.Kafedra;
import niko.ru.ime.model.Menu;
import niko.ru.ime.model.Photo;

public class Config {

  public static final String ABOUT_US = "about_us";
  public static final String INFO_KAF = "information";
  public static final String EMPLOYEES_FAC = "employees_fac";
  public static final String TEACHERS = "teachers";
  public static final String PHOTO_AUDITOR = "photo";
  public static final String ALBUM = "album";
  public static final String THREE_D = "3d";
  public static final String SHARE = "share";

  public static List<Menu> getMenuList() {
    return Arrays.asList(
        new Menu("Про факультет ІМЕ", ABOUT_US),
        new Menu("Кафедри факультету", INFO_KAF),
        new Menu("Управління факультетом", EMPLOYEES_FAC),
        new Menu("Співробітники факультету", TEACHERS),
        new Menu("Розташування аудиторій", PHOTO_AUDITOR),
        new Menu("Фотоальбом", ALBUM),
        new Menu("3D-подорож", THREE_D),
        new Menu("Поділитися додатком", SHARE)
    );
  }

  public static List<Employee> getEmployeeFacList() {
    return Arrays.asList(
        new Employee("Бєльчев Павло Васильович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/belchev.jpg", "Декан факультету",
            "Наукові ступінь і звання: кандидат педагогічних наук, професор\n"
                + "\n"
                + "В університеті працює з: 2000 року\n"
                + "\n"
                + "Наукові інтереси: викладання фізики за допомогою сучасних технічних засобів навчання"),
        new Employee("Стрілець Олена Володимирівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/strilec.jpg",
            "Заступник декана з навчальної роботи", "В університеті працює з: 2002 року\n"
            + "\n"
            + "Наукові інтереси: застосування комп’ютерних технологій при вивченні алгебри старших класів"),
        new Employee("Сюсюкан Юрій Миколайович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/susukan.jpg",
            "Заступник декана з виховної роботи", "старший викладач"),
        new Employee("Глебова Наталя Іванівна",
            "http://cs624522.vk.me/v624522668/aa5b/s_F8sEDQLaI.jpg",
            "Заступник декана з наукової роботи",
            "Наукові ступінь і звання: кандидат соціологічних наук, доцент"),
        new Employee("Николаєнко Юлія Олександрівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/nikolaenko.jpg",
            "Секретар факультету", "")
    );
  }

  public static List<Object> getTeacherList() {
    List<Object> list = new ArrayList<>();
    list.addAll(kafInf());
    list.addAll(kafMatFiz());
    list.addAll(kafPed());
    list.addAll(kafSoc());
    list.addAll(kafEco());
    list.addAll(kafManagment());
    list.addAll(kafMatInf());
    return list;
  }

  private static List<Object> kafPed() {
    return Arrays.asList("Кафедра педагогіки  і педагогічної майстерності",
        new Employee("Елькін Марк Веніамінович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/elkin.jpg",
            "завідувач кафедри педагогіки та педагогічної майстерності, професор", ""),
        new Employee("Аблаев Эдем Аджиевич",
            "Наукові ступінь і звання: кандидат педагогічних наук, професор\n\nВ університеті працює з: 1972 року",
            "професор кафедри педагогіки та педагогічної майстерності",
            "Наукові ступінь і звання: доктор педагогічних наук, професор\n"
                + "\n"
                + "В університеті працює з: 2014 року"),
        new Employee("Нечипоренко Валентина Василівна", "",
            "доцент кафедри педагогіки та педагогічної майстерності",
            "Наукові ступінь і звання: доктор педагогічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2012 року"),
        new Employee("Окса Микола Миколайович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/oksa.jpg",
            "професор кафедри педагогіки та педагогічної майстерності",
            "Наукові ступінь і звання: кандидат педагогічних наук, професор\n"
                + "\n"
                + "В університеті працює з: 1987 року\n"
                + "\n"
                + "Наукові інтереси: дослідження педагогічної спадщини А.С.Макаренка"),
        new Employee("Коробченко Ангеліна Анатоліївна", "",
            "професор кафедри педагогіки та педагогічної майстерності",
            "Наукові ступінь і звання: кандидат педагогічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 1997 року"),
        new Employee("Бєльчева Тетяна Федорівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/belcheva.jpg",
            "доцент кафедри педагогіки та педагогічної майстерності",
            "Наукові ступінь і звання: кандидат педагогічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2000 року"),
        new Employee("Головкова Марина Михайлівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/golovkova.jpg",
            "доцент кафедри педагогіки та педагогічної майстерності",
            "Наукові ступінь і звання: кандидат педагогічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 1992 року"),
        new Employee("Воровка Маргарита Іванівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/vorovka_m.jpg",
            "доцент кафедри педагогіки та педагогічної майстерності",
            "Наукові ступінь і звання: кандидат педагогічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 1996 року"),
        new Employee("Ізбаш Світлана Сергіївна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/izbash.jpg",
            "доцент кафедри педагогіки та педагогічної майстерності",
            "Наукові ступінь і звання: кандидат педагогічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 1995 року"),
        new Employee("Кожевнікова Ала Власівна", "",
            "старший викладач кафедри педагогіки та педагогічної майстерності",
            "Наукові ступінь і звання: кандидат педагогических наук\n"
                + "\n"
                + "В університеті працює з: 2005 року"),
        new Employee("Антоновський Олег Вікторович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/antonovski.jpg",
            "старший викладач кафедри педагогіки та педагогічної майстерності",
            "Наукові ступінь і звання: кандидат педагогічних наук\n"
                + "\n"
                + "В університеті працює з: 2005 року"),
        new Employee("Кучина Любов Іванівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/kuchina.jpg",
            "старший викладач кафедри педагогіки та педагогічної майстерності, керівник практик",
            "В університеті працює з: 1986 року"),
        new Employee("Найдиш Жанна Григорівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/naidish_j.jpg",
            "старший викладач кафедри педагогіки та педагогічної майстерності, керівник практик",
            "В університеті працює з: 1973 року"),
        new Employee("Бунчук Оксана Володимирівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/bunchuk.jpg",
            "асистент кафедри педагогіки та педагогічної майстерності",
            "Наукові ступінь і звання: кандидат педагогічних наук\n"
                + "\n"
                + "В університеті працює з: 2008 року"),
        new Employee("Заворотна Ярослава Вікторівна", "",
            "асистент кафедри педагогіки та педагогічної майстерності",
            "Наукові ступінь і звання: кандидат педагогічних наук\n"
                + "\n"
                + "В університеті працює з: 2010 року"),
        new Employee("Костєва Юлія Іванівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/kosteva.jpg",
            "асистент кафедри педагогіки та педагогічної майстерності",
            "Наукові ступінь і звання: кандидат педагогічних наук\n"
                + "\n"
                + "В університеті працює з: 2010 року"),
        new Employee("Єрмак Юлія Іванівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/ermak.jpg",
            "асистент кафедри педагогіки та педагогічної майстерності",
            "В університеті працює з: 2008 року"),
        new Employee("Федоренко Дар’я Олександрівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/fedorenko.jpg",
            "асистент кафедри педагогіки та педагогічної майстерності",
            "В університеті працює з: 2008 року"),
        new Employee("Федорук Наталя Іванівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/fedoruk.jpg",
            "старший лаборант кафедри педагогіки та педагогічної майстерності",
            "В університеті працює з: 1986 року"),
        new Employee("Волик Алла Олександрівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pedagogika/volik.jpg",
            "лаборант кафедри педагогіки та педагогічної майстерності",
            "В університеті працює з: 2001 року"));
  }

  private static List<Object> kafMatInf() {
    return Arrays.asList("Кафедра прикладної математики та інформаційних технологій",
        new Employee("Найдиш Андрій Володимирович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/najdich.jpg",
            "професор кафедри прикладної математики та інформаційних технологій",
            "Наукові ступінь і звання: доктор технічних наук, професор\n"
                + "\n"
                + "В університеті працює з: 2001 року\n"
                + "\n"
                + "Наукові інтереси: геометричне моделювання процесів і явищ"),
        new Employee("Лебедєв Володимир Олександрович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/lebedev.jpg",
            "доцент кафедри прикладної математики та інформаційних технологій",
            "Наукові ступінь і звання: кандидат технічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2004 року\n"
                + "\n"
                + "Наукові інтереси: використання мультимедійних технологій у викладанні технічних дисциплін"),
        new Employee("Бездітний Андрій Олександрович", "",
            "доцент кафедри прикладної математики та інформаційних технологій",
            "Наукові ступінь і звання: кандидат технічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2014 року\n"
                + "\n"
                + "Наукові інтереси: прикладна геометрія, система автоматизованого проектування"),
        new Employee("Кучеренко Вадим Володимирович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pm_it/kucherenko.jpg",
            "доцент кафедри прикладної математики та інформаційних технологій",
            "Наукові ступінь і звання: кандидат технічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2014 року\n"
                + "\n"
                + "Наукові інтереси: прикладна геометрія, оптика, CAD – системи"),
        new Employee("Гавриленко Євген Андрійович", "",
            "доцент кафедри прикладної математики та інформаційних технологій",
            "Наукові ступінь і звання: кандидат технічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2014 року\n"
                + "\n"
                + "Наукові інтереси: варіативне дискретне  геометричне моделювання кривих ліній та поверхонь, дискретне  геометричне моделювання явищ та процесів"),
        new Employee("Холодняк Юлія Володимирівна", "",
            "асистент кафедри прикладної математики та інформаційних технологій",
            "В університеті працює з: 2014 року\n"
                + "\n"
                + "Наукові інтереси: варіативне дискретне  геометричне моделювання кривих ліній"),
        new Employee("Літвінов Антон Ігорович", "",
            "викладач-стажист кафедри прикладної математики та інформаційних технологій",
            "В університеті працює з: 2014 року\n"
                + "\n"
                + "Наукові інтереси: криптографічні методи, прикладна геометрія"),
        new Employee("Громик Інна Петрівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/pm_it/gromik.jpg",
            "старший лаборант кафедри прикладної математики та інформаційних технологій",
            "В університеті працює з: 2014 року"));
  }

  private static List<Object> kafManagment() {
    return Arrays.asList("Кафедра менеджменту і туристичної індустрії",
        new Employee("Донченко Лариса Михайлівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/menedjment/donchenko.jpg",
            "завідувач кафедри менеджменту та туристичної індустрії, доцент",
            "Наукові ступінь і звання: кандидат географічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 1988 року\n"
                + "\n"
                + "Наукові інтереси: дослідження розвитку туристично-курортної галузі"),
        new Employee("Олексенко Роман Іванович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/menedjment/oleksenko.jpg",
            "доцент кафедри менеджменту та туристичної індустрії",
            "Наукові ступінь і звання: кандидат економічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2009 року\n"
                + "\n"
                + "Наукові інтереси: аналіз конкурентоспроможності підприємств, дослідження філософії ринку та ринкової кон’юнктури"),
        new Employee("Гурбик Юрій Юрійович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/menedjment/gurbik.jpg",
            "доцент кафедри менеджменту та туристичної індустрії",
            "Наукові ступінь і звання: кандидат наук з державного управління, доцент\n"
                + "\n"
                + "В університеті працює з: 2016 року\n"
                + "\n"
                + "Наукові інтереси: питання державного регулювання рекреаційно-туристичної сфери в умовах розвитку інституціонального середовища."),
        new Employee("Стецишин Микола Миколайович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/menedjment/stecishin.jpg",
            "доцент кафедри менеджменту та туристичної індустрії",
            "Наукові ступінь і звання: кандидат економічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 1989 року\n"
                + "\n"
                + "Наукові інтереси: наукові дослідження, пов’язані з проблемами еколого-економічної ефективності управління природокористування в АПК Запорізького регіону"),
        new Employee("Щебликіна Зоя Вікторівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/menedjment/cheblikina.jpg",
            "старший викладач кафедри менеджменту та туристичної індустрії",
            "В університеті працює з: 2010 року\n"
                + "\n"
                + "Наукові інтереси: управління діяльністю машинобудівних підприємств в умовах ринкових відносин"),
        new Employee("Дебедєва Олена Анатоліївна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/menedjment/lebedeva.jpg",
            "старший викладач кафедри менеджменту та туристичної індустрії",
            "В університеті працює з: 2010 року\n"
                + "\n"
                + "Наукові інтереси: питання дослідження сутності соціально-орієнтованої економіки та перспективами соціального спрямування економічного розвитку держави."),
        new Employee("Рибальченко Ніна Павлівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/menedjment/gosteva.jpg",
            "асистент кафедри менеджменту та туристичної індустрії",
            "В університеті працює з: 2008 року\n"
                + "\n"
                + "Наукові інтереси: дослідження структури державного управління туристичної галузі"),
        new Employee("Ковалевська Марина Вікторівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/menedjment/kovalevcka.jpg",
            "лаборант кафедри менеджменту та туристичної індустрії",
            "В університеті працює з: 2009 року"));
  }

  private static List<Object> kafEco() {
    return Arrays.asList("Кафедра економіки",
        new Employee("Петренко Володимир Андрійович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/ekonomika/petrenko.jpg",
            "завідувач кафедри економіки, доцент",
            "Наукові ступінь і звання: кандидат економічних наук, доцент\n"
                + "\n"
                + "Дисципліни, які викладає: економіка, макроекономіка, мікроекономіка, основи медіаграмотності, управління інформаційними ресурсами\n"
                + "\n"
                + "В університеті працює з: 2006 року\n"
                + "\n"
                + "Наукові інтереси: економічні аспекти інформаційної діяльності у глобальному і національному вимірах, механізми управління і контролю в інформаційній сфері, ефективність функціонування засобів масової інформації"),
        new Employee("Марченко Оксана Анатоліївна", "", "професор кафедри економіки",
            "Наукові ступінь і звання: доктор економічних наук, професор\n"
                + "\n"
                + "Дисципліни, які викладає: економіка праці та інноваційна діяльність,  економіка підприємства,  маркетинг, світова економіка\n"
                + "\n"
                + "В університеті працює з: 1995 року\n"
                + "\n"
                + "Наукові інтереси: механізми управління розвитком та удосконалення туристичної індустрії в Україні, принципи та механізми формування структури й конкурентоспроможності іміджевих брендів у галузі туризму, формування інноваційних туристичних кластерів як конкурентної переваги регіональної структури туристичної індустрії."),
        new Employee("Грибова Діана Вікторівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/ekonomika/gribova.jpg",
            "доцент кафедри економіки",
            "Наукові ступінь і звання: кандидат економічних наук, доцент\n"
                + "\n"
                + "Дисципліни, які викладає: теорія організацій, мікроекономіка, страхування, інвестування, потенціал і розвиток підприємства\n"
                + "\n"
                + "В університеті працює з: 2009 року\n"
                + "\n"
                + "Наукові інтереси: економічна сутність ціни в умовах ринкових відносин, грошові системи, економіка підприємства, суть підприємства, його цілі і завдання"),
        new Employee("Верховод Ірина Сергіївна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/ekonomika/verxovod.jpg",
            "доцент кафедри економіки",
            "Наукові ступінь і звання: кандидат економічних наук, доцент\n"
                + "\n"
                + "Дисципліни, які викладає: економіка, глобалістика, ризикологія, ціноутворення, економіка освіти\n"
                + "\n"
                + "В університеті працює з: 2002 року"),
        new Employee("Біляєв Сергій Сергійович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/ekonomika/biliaev.jpg",
            "доцент кафедри економіки",
            "Наукові ступінь і звання: кандидат економічних наук, доцент\n"
                + "\n"
                + "Дисципліни, які викладає: фінанси, основи зовнішньоекономічної діяльності, гроші та кредит, міжнародні економічні відносини\n"
                + "\n"
                + "В університеті працює з: 2001 року\n"
                + "\n"
                + "Наукові інтереси: міжнародна діяльність"),
        new Employee("Яценко Анастасія Дмитрівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/ekonomika/jacenko.jpg",
            " викладач-стажист кафедри економіки",
            "Дисципліни, які викладає: стратегія підприємства\n"
                + "\n"
                + "В університеті працює з 2016 року\n"
                + "\n"
                + "Наукові інтереси: Рекреаційне природокористування на півдні України, дослідження з питань становлення та розвитку туристичної індустрії в України."),
        new Employee("Ніколаєвич Олександра Вікторівна", "", "викладач-стажист кафедри економіки",
            "Дисципліни, які викладає: обґрунтування господарських рішень і оцінювання ризиків,  облік і аудит,  економіка\n"
                + "\n"
                + "В університеті працює з 2014 року\n"
                + "\n"
                + "Наукові інтереси: Теорія макроекономічних коливань в умовах циклічності економіки."),
        new Employee("Анашкіна Олена Іванівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/ekonomika/anachkina.jpg",
            "старший лаборант кафедри економіки", "В університеті працює з: 1997 року"));
  }

  private static List<Object> kafSoc() {
    return Arrays.asList("Кафедра соціології",
        new Employee("Афанасьєва Людмила Василівна",
            "https://pp.vk.me/c622020/v622020824/10646/0MCRosHtyvU.jpg",
            "завідувач кафедри соціології, завідувач лабораторії соціологічних досліджень університету (лабораторія є структурним підрозділом Всеукраїнської соціологічної служби), директор Центру трансферу технологій університету, член робочої групи «Створення комфортних умов для життя» в розробці «Стратегії розвитку міста Мелітополя до 2020 року», активний учасник проекту «Мелітополь - інтеркультурне європейське місто» (проект спрямований на вивчення потенціалу управління етнокультурним розмаїттям на місцевому рівні та міжкультурного підходу до нього), член робочої групи з культурного мапування міста «Мелітополь - культурне місто» в рамках розвитку української мережі",
            "Наукові ступінь і звання: кандидат філософських наук, доцент\n"
                + "\n"
                + "В університеті працює з: 1985 року\n"
                + "\n"
                + "Наукові інтереси: міжетнічні та міжконфесійні відносини в контексті суспільних трансформацій; етнічна ідентичність в контексті розвитку етно-національних об'єднань, роль географічного чинника в етнокультурних процесах; вплив суспільного середовища на формування толерантності освітньої молоді; міське поліетнічне середовище як референт етнічної толерантності"),
        new Employee("Глинська Людмила Федорівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/sosiologia/glinska.jpg",
            "доцент кафедри соціології",
            "Наукові ступінь і звання: кандидат філософських наук, доцент\n"
                + "\n"
                + "В університеті працює з: 1988 року\n"
                + "\n"
                + "Наукові інтереси: соціокультурні процеси краю, світоглядні уявлення народів, усно-історичні аспекти дослідження історичних подій"),
        new Employee("Букрєєва Ірина Вікторівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/sosiologia/bukreeva.jpg",
            "доцент кафедри соціології, старший науковий співробітник лабораторії соціологічних досліджень університету",
            "Наукові ступінь і звання: кандидат філософських наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2000 року\n"
                + "\n"
                + "Наукові інтереси: механізми політичної соціалізації українського населення, адаптація політичної свідомості та культури до вимог європейського співтовариства, дослідження міжетнічних відносин: толерантність та прояви ксенофобії в полі етнічному середовищі, гуманізація і гуманітаризація освіти, роль освіти у професійній мобільності людей"),
        new Employee("Орлов Андрій Володимирович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/sosiologia/orlov.jpg",
            "доцент кафедри соціології, старший науковий співробітник лабораторії соціологічних досліджень університету",
            "Наукові ступінь і звання: кандидат філософських наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2000 року"),
        new Employee("Глебова Наталя Іванівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/sosiologia/glebova.jpg",
            "доцент кафедри соціології",
            "Наукові ступінь і звання: кандидат соціологічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2003 року\n"
                + "\n"
                + "Наукові інтереси: спеціальні та галузеві соціології"),
        new Employee("Ідрісов Бахтійор", "", "доцент кафедри соціології",
            "Наукові ступінь і звання: кандидат соціологічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2007 року\n"
                + "\n"
                + "Наукові інтереси: спеціальні та галузеві соціології"),
        new Employee("Петровська Ірина Анатоліївна", "", "старший лаборант кафедри соціології",
            "В університеті працює з: 2004 року"));
  }

  private static List<Object> kafMatFiz() {
    return Arrays.asList("Кафедра математики і фізики",
        new Employee("Верещага Віктор Михайлович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/matematika/verechaga_.jpg",
            "завідувач кафедри математики і фізики",
            "Наукові ступінь і звання: доктор технічних наук, професор\n"
                + "\n"
                + "В університеті працює з: 2013 року\n"
                + "\n"
                + "Наукові інтереси: дискретне геометричне моделювання кривих лінійних поверхонь"),
        new Employee("Бєльчев Павло Васильович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/matematika/belchev.jpg",
            "професор кафедри математики і фізики",
            "Наукові ступінь і звання: кандидат педагогічних наук, професор\n"
                + "\n"
                + "В університеті працює з: 2000 року\n"
                + "\n"
                + "Наукові інтереси: викладання фізики за допомогою сучасних технічних засобів навчання"),
        new Employee("Рубцов Микола Олексійович", "", "доцент кафедри математики і фізики",
            "Наукові ступінь і звання: кандидат технічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2001 року\n"
                + "\n"
                + "Наукові інтереси: застосування комп’ютерних технологій при вивченні математичного аналізу"),
        new Employee("Баришевський Сергій Олегович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/matematika/bapishevski.jpg",
            "доцент кафедри математики і фізики",
            "Наукові ступінь і звання: кандидат фізико-математичних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2008 року\n"
                + "\n"
                + "Наукові інтереси: системний аналіз та математичне моделювання в умовах невизначеності"),
        new Employee("Спірінцев Дмитро Васильович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/matematika/spirincev.jpg",
            "доцент кафедри математики і фізики",
            "Наукові ступінь і звання: кандидат технічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2013 року\n"
                + "\n"
                + "Наукові інтереси: варіативне дискретне геометричне моделювання"),
        new Employee("Вагіс Алла Іванівна", "", "старший викладач кафедри математики і фізики",
            "Наукові ступінь і звання: кандидат педагогічних наук\n"
                + "\n"
                + "В університеті працює з: 2013 року\n"
                + "\n"
                + "Наукові інтереси: формування математичних компетенцій студентів засобами ІКТ"),
        new Employee("Стрілець Олена Володимирівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/matematika/strelec.jpg",
            "старший викладач кафедри математики і фізики", "В університеті працює з: 2002 року\n"
            + "\n"
            + "Наукові інтереси: застосування комп’ютерних технологій при вивченні алгебри старших класів"),
        new Employee("Титаренко Наталія Євгенівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/matematika/titarenko.jpg",
            "старший викладач кафедри математики і фізики", "В університеті працює з: 2004 року\n"
            + "\n"
            + "Наукові інтереси: математика, психологія, економіка"),
        new Employee("Яковенко Анастасія Сергіївна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/matematika/yakovenko.jpg",
            "асистент кафедри математики і фізики", "В університеті працює з: 2007 року\n"
            + "\n"
            + "Наукові інтереси: асимптотичні методи та теорія усереднення, обчислювальна математики, використання комп'ютерних технологій при вивченні математики"),
        new Employee("Бєсова Олена Георгіївна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/matematika/besova.jpg",
            "асистент кафедри математики і фізики", "В університеті працює з: 2008 року\n"
            + "\n"
            + "Наукові інтереси: використання засобів мультимедія на уроках математики"),
        new Employee("Муртазієв Ернест Гафарович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/matematika/murtaziev.jpg",
            "викладач-стажист кафедри математики і фізики", "В університеті працює з: 2008 року\n"
            + "\n"
            + "Наукові інтереси: підготовка майбутніх вчителів в університеті до реалізації культурно-історичної складової змісту шкільної природничо-математичної освіти"),
        new Employee("Таблер Олена Віталіївна", "", "старший лаборант кафедри математики і фізики",
            "В університеті працює з: 2014 року"));
  }

  private static List<Object> kafInf() {
    return Arrays.asList("Кафедра інформатики і кібернетики",
        new Employee("Осадчий Вячеслав Володимирович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/osadchiy.jpg",
            "завідувач кафедри інформатики і кібернетики, професор",
            "Наукові ступінь і звання: доктор педагогічних наук, професор\n"
                + "\n"
                + "В університеті працює з: 1999 року\n"
                + "\n"
                + "Наукові інтереси: професійна підготовка програмістів; інформаційно-комунікаційні технології у професійній підготовці майбутніх учителів"),
        new Employee("Єремєєв Володимир Сергійович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/eremeev.jpg",
            "професор кафедри інформатики і кібернетики",
            "Наукові ступінь і звання: доктор технічних наук, професор\n"
                + "\n"
                + "В університеті працює з: 1995 року\n"
                + "\n"
                + "Наукові інтереси: розробка програмних засобів для забезпечення навчального процесу"),
        new Employee("Брянцева Ганна Володимирівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/brianceva_.jpg",
            "доцент кафедри інформатики і кібернетики",
            "Наукові ступінь і звання: кандидат педагогічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 1994 року\n"
                + "\n"
                + "Наукові інтереси: комп’ютерні презентації в навчальному процесі"),
        new Employee("Шаров Сергій Володимирович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/sharov.jpg",
            "доцент кафедри інформатики і кібернетики",
            "Наукові ступінь і звання: кандидат педагогічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2000 року\n"
                + "\n"
                + "Наукові інтереси: використання інформаційних технологій для підтримки самостійної роботи студентів"),
        new Employee("Осадча Катерина Петрівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/osadcha.jpg",
            "доцент кафедри інформатики і кібернетики",
            "Наукові ступінь і звання: кандидат педагогічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2002 року\n"
                + "\n"
                + "Наукові інтереси: Інтернет - технології, дистанційне навчання, e-learning"),
        new Employee("Круглик Владислав Сергійович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/kruglik.jpg",
            "доцент кафедри інформатики і кібернетики",
            "Наукові ступінь і звання: кандидат педагогічних наук, доцент\n"
                + "\n"
                + "В університеті працює з: 2015 року\n"
                + "\n"
                + "Наукові інтереси: веб-програмування, організація роботи програмістів у команді, проблеми розробки програмних продуктів, профейсійна підготовка майбутніх програмістів, інформаційно-комунікаційні технології в освіті, дистанційні технології навчання."),
        new Employee("Наумук Ірина Миколаївна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/naumuk_i.jpg",
            "асистент кафедри інформатики і кібернетики",
            "Наукові ступінь і звання: кандидат педагогічних наук\n"
                + "\n"
                + "В університеті працює з: 2016 року\n"
                + "\n"
                + "Наукові інтереси: медіа освіта та медіаграмотність; використання інформаційно-комунікаційних технологій в освіті"),
        new Employee("Постильна Олена Олексіївна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/postilna.jpg",
            "асистент кафедри інформатики і кібернетики",
            "Наукові ступінь і звання: кандидат педагогічних наук\n"
                + "\n"
                + "В університеті працює з: 1992 року\n"
                + "\n"
                + "Наукові інтереси: використання інформаційно-комунікаційних технологій у моральному вихованні студентської молоді"),
        new Employee("Брянцев Олександр Анатолійович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/briancev.jpg",
            "старший викладач кафедри інформатики і кібернетики",
            "В університеті працює з: 2004 року\n"
                + "\n"
                + "Наукові інтереси: комп’ютерний дизайн педагогічних програмних засобів"),
        new Employee("Конюхов Сергій Леонідович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/konuxov.jpg",
            "старший викладач кафедри інформатики і кібернетики",
            "В університеті працює з: 2009 року\n"
                + "\n"
                + "Наукові інтереси: використання інформаційних технологій в освіті"),
        new Employee("Балута Вікторія Сергіївна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/baluta.jpg",
            "асистент кафедри інформатики і кібернетики", "В університеті працює з: 2004 року\n"
            + "\n"
            + "Наукові інтереси: розробка систем штучного інтелекту; моделювання онтологій та експертних систем; сучасні тенденції освіти в контексті навчання дорослих"),
        new Employee("Чорна Альона Віталіївна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/chorna_a.jpg",
            "асистент кафедри інформатики і кібернетики", "В університеті працює з: 2012 року\n"
            + "\n"
            + "Наукові інтереси: дистанційні технології; інформаційно - комунікаційні технології в освіті"),
        new Employee("Наумук Олексій Володимирович",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/naumuk_a.jpg",
            "викладач-стажист кафедри інформатики і кібернетики",
            "В університеті працює з: 2008 року\n"
                + "\n"
                + "Наукові інтереси: інформаційно- комунікаційні технології в освіті"),
        new Employee("Чемерис Ганна Юріївна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/chemeris.jpg",
            "викладач-стажист кафедри інформатики і кібернетики",
            "В університеті працює з: 2016 року\n"
                + "\n"
                + "Наукові інтереси: професійна підготовка фахівців з дизайну"),
        new Employee("Сердюк Ірина Миколаївна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/serduk_.jpg",
            "асистент кафедри інформатики і кібернетики", "В університеті працює з: 1992 року"),
        new Employee("Пилипенко Олена Андріївна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/pilipenko.jpg",
            "старший лаборант кафедри інформатики і кібернетики",
            "В університеті працює з: 2001 року"),
        new Employee("Садова Тетяна Олександрівна",
            "http://mdpu.org.ua/new/images/stories/fakulteti/inf/informatika/sadova.jpg",
            "лаборант кафедри інформатики і кібернетики", "В університеті працює з: 2016 року"));
  }

  public static List<Photo> getAuditorPhoto() {
    return Arrays.asList(
        new Photo("РЕКТОРАТ УНІВЕРСИТЕТУ",
            "http://mdpu.org.ua/new/images/files/priloshenie/1(2).jpg"),
        new Photo("РЕКТОРАТ ТА КАНЦЕЛЯРІЯ",
            "http://mdpu.org.ua/new/images/files/priloshenie/1(3).jpg"),
        new Photo("АУД. 74-76", "http://mdpu.org.ua/new/images/files/priloshenie/1(4).jpg"),
        new Photo("МІЖНАРОДНИЙ ВІДДІЛ", "http://mdpu.org.ua/new/images/files/priloshenie/1(5).jpg"),
        new Photo("АУД. 28-30", "http://mdpu.org.ua/new/images/files/priloshenie/1(7).jpg"),
        new Photo("АУД. 31-32", "http://mdpu.org.ua/new/images/files/priloshenie/1(8).jpg"),
        new Photo("КАФЕДРА ІНФОРМАТИКИ І КІБЕРНЕТИКИ",
            "http://mdpu.org.ua/new/images/files/priloshenie/1(9).jpg"),
        new Photo("КАБ. 39-41", "http://mdpu.org.ua/new/images/files/priloshenie/1(10).jpg"),
        new Photo("АКТОВИЙ ЗАЛ", "http://mdpu.org.ua/new/images/files/priloshenie/1(11).jpg"),
        new Photo("ДЕКАНАТ, АУД. 49", "http://mdpu.org.ua/new/images/files/priloshenie/1(12).jpg"),
        new Photo("КАФЕДРА МАТЕМАТИКИ І ФІЗИКИ",
            "http://mdpu.org.ua/new/images/files/priloshenie/1(14).jpg"),
        new Photo("2-3 ПОВЕРХ", "http://mdpu.org.ua/new/images/files/priloshenie/1(15).jpg"),
        new Photo("СТУДКОМ", "http://mdpu.org.ua/new/images/files/priloshenie/1(6).jpg")
    );
  }

  public static List<Photo> getAlbumPhoto() {
    return Arrays.asList(
        new Photo("МДПУ ім. Богдана Хмельницького",
            "http://mdpu.org.ua/new/images/files/priloshenie/album/n1_1.jpg"),
        new Photo("ДЕКАНАТ ІМЕ", "http://mdpu.org.ua/new/images/files/priloshenie/album/n1_13.jpg"),
        new Photo("ТЕМПУС", "http://mdpu.org.ua/new/images/files/priloshenie/album/n1_16.jpg"),
        new Photo("МУЗЕЙ ІСТОРІЇ",
            "http://mdpu.org.ua/new/images/files/priloshenie/album/panoram1.jpg"),
        new Photo("МДПУ 90 РОКІВ",
            "http://mdpu.org.ua/new/images/files/priloshenie/album/panoram2.jpg"),
        new Photo("ГОЛОВНИЙ КОРПУС МДПУ",
            "http://mdpu.org.ua/new/images/files/priloshenie/album/n1_17.jpg"),
        new Photo("Бібліотека", "http://mdpu.org.ua/new/images/files/priloshenie/album/n1_18.jpg"),
        new Photo("Площа перед корпусом",
            "http://mdpu.org.ua/new/images/files/priloshenie/album/n1_19.jpg"),
        new Photo("Спортивний зал ",
            "http://mdpu.org.ua/new/images/files/priloshenie/album/n1_20.jpg")
    );
  }

  public static List<Kafedra> getKafList() {
    return Arrays.asList(
        new Kafedra("Кафедра педагогіки  і педагогічної майстерності",
            "Кафедра педагогіки та педагогічної майстерності є однією з найдавніших в університеті. Першими співробітниками кафедри були Г. М. Авсенєва, В.В. Туча і А.І. Туча. Пізніше на кафедру прийшли доцент О.А. Чуйка, асистенти І.Ф. Мосієнко, С.І. Кочергін, Краславський і Коломійченко. У 1931 році колектив кафедри очолював професор В.М. Добринченко.\n"
                + "\n"
                + "Серед колишніх викладачів кафедри – учасники війни доцент Д.Г. Жолудєв, доцент О.В. Попков, (ректор інституту в 1964 -1977 pp.). У повоєнні роки кафедру педагогіки та психології очолювали к.п.н., доценти А.А. Масич, Т.О. Лихарева, В.П. Мещеряков, Д.Ф. Халаїм, В.І.Радіонов, Д.Г. Жолудєв, В.М. Черемісін, Л.М. Марковець, Л.Ф. Пашко. Із 1994р. до травня 2005 р. кафедру педагогіки очолював заслужений працівник народної освіти України, кандидат педагогічних наук, професор, Ю.П. Болотін (з 1996 р. по 2001 р. – перший проректор).\n"
                + "\n"
                + "Протягом сорока років натхненно працювала на кафедрі доцент М.О. Сазонова, яка в 1971 -1985 роках була про\u00ADректором заочної форми навчання та доцент  Л.П. Куценко.\n"
                + "\n"
                + "У вересні 2005 року кафедра загальної педагогіки була об'єднана з кафедрою педагогічної майстерності й отримала назву \"кафедра педагогіки і пе\u00ADдагогічної майстерності\". Очолив кафедру кандидат педагогічних наук, професор М.В. Елькін, член-кореспондент УАННП, кавалер ордена «Знак Пошани», Заслужений працівник освіти, перший проректор. Працює в університеті з 1974 р.\n"
                + "\n"
                + "На базі кафедри у вересні 2000 р. створено кабінет впровадження сучасних педагогічних технологій, який згодом було реорганізовано у центр впровадження сучасних педагогічних технологій. Керівник – доцент П.В. Бєльчев. З початку створення центру інженерну роботу виконували: про\u00ADвідний інженер С.М. Прийма та інженери С.В. Шаров, О.В. Марко, Ю.Г. Малєв. Метою центру є створення програмного забезпечення для успішної організації навчального процесу в університеті.\n"
                + "\n"
                + "У червні 2006 р. кафедра педагогіки і педагогічної майстерності посіла І місце у конкурсі «Краще методичне забезпечення самостійної роботи студентів з навчальних дисциплін кафедри».\n"
                + "\n"
                + "Навчально-виховний процес та наукову роботу на кафедрі здійснюють досвідчені викладачі – професори Елькін М.В., Окса М.М.,кандидати педагогічних наук, доценти: М.М. Головкова, А.А. Коробченко, М.І. Воровка, Бельчева Т.Ф., С.С. Ізбаш, М.М.Карандаш, О.В. Бунчук, О.В. Антоновський, Семікін М.О., старші викладачі – Л.І. Кучіна, Ж.Г. Найдиш, Г.Г. Петрученя, асистенти – АВ.Кожевнікова, Ю.І.Костєва, Ю.І.Єрмак, Я.В.Заворотна, І.П. Пятишева, Д.О.  Федоренко. Надійними помічниками в роботі викладачів є лаборанти кафедри Н.І. Федорук та А.О. Волік.\n"
                + "\n"
                + "Виховна робота на кафедрі спрямована на досягнення головної мети національної системи освіти – створення умов для розвитку та самореалізації кожної особистості як громадянина України.\n"
                + "\n"
                + "У березні 2008 р. започатковано конкурс педагогічної майстерності «Я – вчитель-професіонал», метою якого стало виховання стійкого інтересу та любові до професії вчителя; формування і розвиток професійних умінь та навичок учителя, класного керівника; сприяння самоосвіті студентів; стимулювання та заохочення систематичної роботи студентів.\n"
                + "\n"
                + "За останні п’ять років кафедра педагогіки та педагогічної майстерності уклала договори про взаємну наукову і педагогічну співпрацю з лабораторією «Макаренко-Реферат» Марбурзького університету (Німеччина), Білоруським державним педагогічним університетом ім. М.Танка (Мінськ), Республікою Польща, природничо-гуманітарним університетом в Сєльдце (Подляська академія). Із 2005 р., згідно з договором про наукове співробітництво між кафедрою і лабораторією «Макаренко-Реферат», започатковано випуск «Наукового вісника МДПУ (Серія: Педагогіка)».\n"
                + "\n"
                + "Кафедра забезпечує викладання основних лекційних курсів, що входять до навчальних планів всіх спеціальностей, а також навчальних курсів магістратури за спеціальністю  «Управління  навчальним  закладом». Викладачі кафедри проводять плідну роботу з методичного забезпечення навчального процесу: розроблений програмований комплекс тематичного тестування, видано посібники під грифом Міністерства освіти і науки України «Основи педагогічної майстерності» та  «Практикум з акмеології навчання і виховання», розроблені  методичні рекомендації з всіх навчальних дисциплін. Своєрідною візитною карткою кафедри стали щорічні виїзні творчі звіти за підсумками літньої педагогічної практики «Ювілейне літо - 2008», «Барвисте літо – 2009», традиційні конкурси педагогічної майстерності «Я – вчитель-професіонал».  Кафедрою налагоджено співпрацю з Федерацією Дитячих Організацій України, проводяться тренінги із підготовки вожатих, здійснюється обмін досвідом.\n"
                + "\n"
                + "З 2009 році на кафедрі було створено науково-педагогічний гурток «Акме», у рамках якого здійснюється студентська наукова робота за чітко визначеним та затвердженим на засіданні кафедри планом.\n"
                + "\n"
                + "До цієї роботи залучені всі викладачі кафедри, які очолюють роботу студентських проблемних груп. Щомісяця на кафедрі проводяться відкриті засідання гуртка, на які запрошувалися викладачі, студенти, магістранти, вчителі загальноосвітніх шкіл. Тематика досліджень наукових гуртків є різноманітною. Склад груп – студенти ІІІ- IV курсів філологічного, хіміко-біологічного, природничо-географічного, факультету інформатики і математики та магістранти. Форми роботи – засідання, круглий стіл, обговорення доповідей, виступи на наукових сесіях та конференціях, публікації в «Студентському меридіані» та інших виданнях, проведення досліджень під час педагогічних практик, написання курсових, дипломних робіт, участь у олімпіадах та конкурсах.\n"
                + "\n"
                + "Кафедра організовує науково-дослідну роботу студентів проблемних груп. Стала доброю традицією щорічна олімпіада з педагогіки. Традиційно вже декілька років поспіль кращі студенти нашого університету посідають призові місця на Всеукраїнських олімпіадах.\n"
                + "\n"
                + "З 2005 року при кафедрі працює аспірантура. У 2013 році навчається 31 аспірант із спеціальності 13.00.01 – загальна педагогіка та історія педагогіки. З 2005 по 2012 рік на кафедрі захистилось 15 осіб.\n"
                + "\n"
                + "У 2012 р. відкрито докторонатуру. Першим докторантом стала к.п.н., доцент Коробченко А.А.\n"
                + "\n"
                + "Контакти:\n"
                + "\n"
                + "тел. кафедри: 44-04-58,     аудиторія 37 навчального корпусу №1"),
        new Kafedra("Кафедра інформатики  і кібернетики",
            "Кафедра інформатики і кібернетики починає свою історію з далекого 1979 року. Саме в цьому році була створена предметна комісія з ТЗН, фізики та математики. Протягом 34 років активного функціонування предметна комісія перетворилася на кафедру інформатики і кібернетики. У складі кафедри 15 викладачів: з них 3 доктора наук, професора, 7 кандидатів наук, доцентів, 1 кандидат наук, старший викладач, 3 старших викладача, 2 асистенти.\n"
                + "\n"
                + "Повноцінному виконанню навчального плану сприяє науково-дослідна робота як професорсько-викладацького складу, так і студентів. Викладачі кафедри постійно беруть участь у наукових конференціях, мають більше 300 публікацій, 50 авторських посвідчень і патентів на винаходи і методичні розробки.\n"
                + "\n"
                + "Наукова діяльність здійснюється у тісній взаємодії з Київським державним педагогічним університетом ім. М.П. Драгоманова, Київським національним університетом імені Тараса Шевченка, Північнокавказьким філіалом федерального державного бюджетного освітнього закладу вищої професійної освіти «Белгородський державний технологічний університет імені В.Г. Шухова» Російської федерації та іншими навчальними і науковими центрами України і Російської федерації. Викладачі кафедри активно взаємодіють із МАН з напряму «Математика» та школою математики і інформатики. На кафедрі інформатики і кібернетики діє аспірантура під керівництвом доктора технічних наук, професора Єремєєва В.С.\n"
                + "\n"
                + "Наукова робота проводилась в напрямку фундаментальних (теоретичних) і практичних досліджень відповідно до пріоритетних напрямів наукових досліджень в області інформаційних технологій та наукових спеціалізацій викладачів, а саме: комп’ютерна підтримка самостійної роботи студентів, методичні основи застосування електронних навчальних засобів, мережеві технології розробки та використання електронних підручників. На кафедрі ведуться дослідження з математичного моделювання, розробляються комп'ютерні та мережні технології для використання в навчальному процесі, в тому числі для дистанційного навчання.\n"
                + "\n"
                + "Кафедра інформатики і кібернетики здійснює наукові дослідження з проблем розробки та використання комп'ютерних технологій у навчальному процесі. Під керівництвом кандидата педагогічних наук, доцента Прийми С.М. виконується держбюджетна тема ДР № 0112U001631 «Інформаційні технології в навчальному процесі» напряму «Педагогіка, проблеми змісту і методів спеціальної освіти». У межах означуваного напрямку викладачі кафедри опрацьовують індивідуальні наукові теми. Про результати своїх досліджень вони доповідають на міжнародних і всеукраїнських конференціях, друкують у збірниках наукових праць та навчально-методичних виданнях.\n"
                + "\n"
                + "У відповідності до науково-дослідної теми на кафедрі інформатики і кібернетики, за результатами наукових досліджень було отримано 2 грифа «Рекомендовано Міністерством освіти і науки, молоді та спорту України» (№1/11-1279 від 01.02.12, №1/11-1274 від 01.02.12), два патенти України на винахід (№ 48405 від 12.04.2010) та декілька свідоцтв на авторське право (№30198 від 11.09.2009, 30787 від 27.10.2009 р., №33020 від 28.04.2010, свідоцтво № 43981 від 28 травня 2012 р. та ін), проведена V Всеукраїнська науково-практична конференція «Нові інформаційні технології в освіті та природничо-математичних науках», яка відбулася 22-23 березня 2012 року. Отримані результати наукових досліджень використовуються в навчальному процесі по підготовці бакалаврів і спеціалістів Мелітопольського державного педагогічного університету імені Богдана Хмельницького.\n"
                + "\n"
                + "Важливим завданням науково-педагогічних працівників кафедри інформатики і кібернетики є стимулювання науково–пошукової творчості студентської молоді. На кафедрі проводиться робота щодо виявлення обдарованих студентів, які займаються науковою роботою, розширюють свій кругозір, беруть участь в наукових конференціях університету та міст України.\n"
                + "\n"
                + "Кафедра кілька років поспіль виступає організатором щорічної Всеукраїнської науково-практичної конференції з питань теорії і методики навчання інформатики і математики «Нові інформаційні технології в освіті та природничо-математичних науках», за результатами якої випускає збірки наукових праць.\n"
                + "\n"
                + "Наказом МОН України від 5 квітня 2007 року № 282 було затверджено створення мережі регіональних центрів з розробки та впровадження електронних засобів навчання для вищих педагогічних навчальних закладів. На базі університету було створено Регіональний центр з розробки, впровадження та апробації електронних підручників. В розробці електронних підручників беруть участь викладачі кафедри, автори підручників та навчальних посібників. Протягом 5 років співробітниками регіонального центру та викладачами кафедри було створено близько 30 електронних підручників з біології, інформатики, географії, історії, математики, української літератури. Керівник центру доктор технічних наук, професор кафедри інформатики і кібернетики Єремєєв В.С.\n"
                + "\n"
                + "Спеціальності\n"
                + "\n"
                + "Комп’ютерні науки та інформаційні технології\n"
                + "\n"
                + "Освітня програма: Бакалавр, Магістр\n"
                + "\n"
                + "Середня освіта. Інформатика\n"
                + "\n"
                + "Освітня програма: Бакалавр, Магістр\n"
                + "\n"
                + "На яких посадах можуть працювати випускники кафедри\n"
                + "\n"
                + "Технік-програміст, фахівець з інформаційних технологій, фахівець з розроблення комп'ютерних програм, фахівець з комп'ютерної графіки (дизайну), фахівець з розробки та тестування програмного забезпечення, інженер-програміст, науковий співробітник\n"
                + "\n"
                + "Здійснювати викладацьку, навчально-виховну, науково-методичну й організаційно-керівницьку діяльність в системі освіти України\n"
                + "\n"
                + "Випускники кафедри\n"
                + "\n"
                + "Можайський С. (Globallogic, Нью-Йорк), Швабський А. (Yelp, Сан-Бруно),  Спузяк С. (BitGold, Торонто), Покопцев О. (УНН, Київ), Шапошніков О. (Luxoft, Москва), Опанасенко О. і  Опанасенко С. (Мегаплан.Украина, SADESIGN, Київ), Вергун А. (Hypernaut, Київ), Харитонов І. (Moventum, Варшава), Пугачов С. (Dedsert, Ірландія), Дубич О. (Vsesvit, Мелітополь), Бурдей В. (Yelp, Сан-Франциско), Єжов М. (One, Inc., Сакременто) та ін..\n"
                + "\n"
                + "Мови програмування, програмні продукти, технології\n"
                + "\n"
                + "Python, С/С++/C#, Java,  1С, Пролог; Oracle, MySQL, Microsoft Windows, Office, Linux, Unix, Visual Studio, Eclipse, NetBeans, IDLE, Anaconda, GIMP, Adobe Photoshop; веб-технології (PHP/ MySQL/ HTML/ JavaScript/CSS/JQuery) тощо.\n"
                + "\n"
                + "Чого навчаємо?\n"
                + "\n"
                + "Розробляти корпоративні сайти, веб-сервіси, ігри, десктопні та серверні програми, високонавантажені системи, операційні системи; програмувати роботів та мікроконтролери; налагоджувати комп’ютерні мережі; тестувати програмне забезпечення; здійснювати наукове дослідження у галузі ІТ\n"
                + "\n"
                + "Контакти:\n"
                + "\n"
                + "тел.: +38(0619) 44-80-29\n"
                + "\n"
                + "E-mail:\n"
                + "\n"
                + "infkib@mdpu.org.ua"
                + "\n"),
        new Kafedra("Кафедра математики  і фізики",
            "Кафедра математики і фізики була створена у 2003 році. Завідувачем кафедри (2003-2006 рр.) обрали кандидата педагогічних наук, доцента, Відмінника освіти України Данилевич Людмилу Петрівну. З 2006 року кафедру очолює кандидат педагогічних наук, доцент, Відмінник освіти України Бєльчев Павло Васильович. При кафедрі діє секція з використання технічних засобів навчання у навчальному процесі, до складу якої входять викладачі кафедри.\n"
                + "\n"
                + "Навчально-виховний процес та наукову роботу на кафедрі здійснює професорського-викладацький склад, кваліфікація якого відповідає зайнятим посадам, задовольняє вимогам навчально-методичної, організаційної, виховної роботи, сприяє розв’язанню освітньо-культурних і наукових проблем.Кафедра забезпечує навчальний процес на всіх факультетах університету з дисциплін фізико-математичного циклу та дисциплін, в яких використовуються інформаційні технології в навчальному процесі. Викладачі кафедри читають близько 50 дисциплін. На кафедрі створено бібліотеку електронних ресурсів, яка з кожним роком збільшується.\n"
                + "\n"
                + "Теорія і практика викладання математики реалізується в рамках теми кафедри «Інформаційні технології в навчальному процесі». Метою дослідження є розробка, теоретичне обґрунтування та експериментальна перевірка організаційно-методичних засад використання інформаційних технологій у навчальному процесі.\n"
                + "\n"
                + "Науково-дослідна робота всіх викладачів кафедри математики та фізики проводиться за напрямком «Удосконалення процесу викладання математичних дисциплін у школі та ВНЗ за допомогою впровадження сучасних педагогічних технологій навчання, виховання творчої особистості майбутнього вчителя математики».\n"
                + "\n"
                + "Викладачі кафедри беруть участь у наукових конференціях та семінарах, пишуть наукові статті до збірників ВАК України, зарубіжних і науково-метричних видань. Керує науково-дослідною роботою студентів доцент Баришевський С.О. На кафедрі математики і фізики діє науковий гурток «Радикал», керівником якого з 2013 року є асистент Яковенко А.С. В березні 2013 року студентка 5-го курсу спеціальності «Математика» Шевченко А. брала участь у ІІ турі Всеукраїнського студентського конкурсу наукових робіт з математики в м. Івано-Франківськ (ПНУ ім. В. Стефаника) та посіла ІІІ місце. Кафедра математики та фізики знаходиться на IV поверсі головного корпусу університету (аудиторія 65).\n"
                + "\n"
                + "Контактна адреса: 72312, вул. Леніна 20, м. Мелітополь, Запорізька обл.\n"
                + "\n"
                + "Тел. (0619) 44-80-29\n"
                + "\n"
                + "Електрона адреса: mat_i_fiz@mail.ru"),
        new Kafedra("Кафедра соціології",
            "У вересні 2004 року на базі кафедри «Філософії та соціології», яку очолювала  кандидат філософських наук, доцент Афанасьєва Л.В., була створена кафедра соціології, яка є випускаючою і відповідає за підготовку фахівців зі спеціальності  6.030101 «Соціологія» (ліцензія серія АА № 807782 від 10.11.2004р., протокол № 51, Наказ МОН України від 01.07.2004р. 558). У 2008 році спеціальність «Соціологія» успішно була акредитована за освітньо-кваліфікаційним рівнем «бакалавр» і отримала ліцензії на підготовку фахівців зі спеціальності 7.03010101 «Соціологія» освітньо-кваліфікаційного рівня «спеціаліст» та 8.03010101 освітньо-кваліфікаційного рівня «магістр».\n"
                + "\n"
                + "З 2004 року кафедру соціології очолювала кандидат філософських наук, доцент Афанасьєва Л.В., з 2007 року – заслужений діяч освіти України, доктор філософських наук, професор Шкода В.В. Ним були закладені основи наукового та навчально-методичного потенціалу кафедри.\n"
                + "\n"
                + "З грудня 2012 року кафедру очолює доктор соціологічних наук, професор Катаєв С.Л.\n"
                + "\n"
                + "Викладачі кафедри приділяють достатню увагу оновленню фондів навчально-методичного забезпечення. Це стимулювало розробку нових навчальних посібників до курсу дисциплін професійної підготовки, які рекомендовані МОН України:\n"
                + "\n"
                + "- Методи збору, аналізу та комп’ютерної обробки соціологічної інформації. Навчальний посібник. – Мелітополь: ТОВ «Видавничий будинок ММД», 2008. – 298 с.\n"
                + "\n"
                + "- Катаєв С.Л. Регіонально-адміністративний менеджмент. Під ред. В.Г. Воронкової. Навчальний посібник. – Запоріжжя Видавництво ЗДІА, 2009. – 444 с.\n"
                + "\n"
                + "- Соціальний  менеджмент. Навчальний посібник / Укл. В.Г. Воронкова, О.М. Кіндратець, С.Л.Катаєв і ін. – Запоріжжя: ЗДІА, 2009. – 216.\n"
                + "\n"
                + "- Катаєв С.Л. Історія та теорія соціології. Навчальний посібник. – Запоріжжя: КПУ, 2009. – 196 с.\n"
                + "\n"
                + "- Економічна соціологія: Навчальний посібник / під . ред.. проф. Малахової, Вид-во: КПУ, 2010. – 280 с. (В соавторстве)\n"
                + "\n"
                + "- Філософія науки. Навчальний посібник. – Мелітополь, «Люкс», 2011. – 208 с.\n"
                + "\n"
                + "- Методи збору, аналізу та комп’ютерної обробки соціологічної інформації. Навчальний посібник [Видання друге, перероблене та доповнене].  – Мелітополь: Издательско-полиграфический центр «Люкс», 2012. – 408 с.\n"
                + "\n"
                + "- Словник політологічних, соціологічних та економічних термінів. Нвчальний посібник. – К.: Міленіум, 2012. – 214 с.\n"
                + "\n"
                + "Навчально-виховний процес на кафедрі забезпечують висококваліфіковані фахівці: 1 доктор наук, 1 докторант, 6 кандидатів наук та навчально-допоміжний персонал у кількості 2 чоловік.\n"
                + "\n"
                + "Кафедра має практичний досвід співпраці з Інститутом соціології Національної Академії наук України, Всеукраїнською соціологічною службою, Південноукраїнським агентством соціальних технологій.\n"
                + "\n"
                + "Кафедра соціології плідно співпрацює зі структурними підрозділами МДПУ ім. Б.Хмельницького щодо питань науково-методичної та науково-дослідницької діяльності: кафедрами екології і зоології, ботаніки і садово-паркового господарства, соціальної педагогіки і дошкільної освіти, загальної психології, практичної психології, інформатики і кібернетики, математики і фізики, географії України та краєзнавства, історії та правознавства, лабораторією комплексного краєзнавства, екологічної освіти і сталого розвитку, центром Болгаристики, екологічним центром «Еколайн» тощо. Це знайшло відображення у фундаментальному дослідженні при підтримці Міністерства освіти та науки України «Дослідження особливостей етнокультурного та географічного чинників Східної Таврії у національному розвитку України» та у виданні спільних монографій:\n"
                + "\n"
                + "- Етнокультурні процеси в Запорізькому краї у XIX-XX ст. – Мелітополь-Москва: „Скрипторий”, 2001. – 176 с.\n"
                + "\n"
                + "- Етнокультурні та етноантропологічні чинники в регіональному контексті: на прикладі історії Запорізького краю XIX-XX ст Мелітополь, Москва: „Скрипторий”, 2002. – 196 с.\n"
                + "\n"
                + "- Етнокультурний ландшафт Північного Приазов’я. Монографія / за загал. ред. Афанасьєвої Л.В., Крилова М.В. – Запоріжжя: Обласна державна адміністрація; Мелітополь: МДПУ; Сімферополь: Таврія, 2004. – 276с.\n"
                + "\n"
                + "- Етносоціальне буття народів Запорізького Приазов’я в геокультурному контексті” Монографія / за загал. ред. Аносова І.П., Афанасьєвої Л.В., Крилова М.В., Пригаро М.В. – Запоріжжя: обласна державна адміністрація; Мелітополь, МДПУ, 2006. - 296 с.\n"
                + "\n"
                + "- Етносфера народів Північної Таврії у світоглядно-ментальному вимірі та народній творчості Монографія / За заг.ред. Аносова І.П., Афанасьєвої Л.В., Троїцької Т.С. – Мелітополь, МДПУ, 2006. – 242 с.\n"
                + "\n"
                + "- Соціокультурні та освітні процеси у Запорізькому Приазов’ї: проблеми, пошуки, перспективи: монографія / За ред. Л.В. Афанасьєвої, В.В. Молодиченка, В.В. Нечипоренко – Запоріжжя: Вид-во Хортицького національного навчально-реабілітаційного багатопрофільного центру, 2013. – 608 с.\n"
                + "\n"
                + "При кафедрі працює науковий гурток «Соціологос» за напрямком діяльності «Роль закладів освіти у формуванні ціннісних орієнтацій», в рамках якого ведеться підготовка членів наукового гуртка до участі у Всеукраїнських конкурсах (зайняті ІІ місця з гендерних досліджень і політичних наук), олімпіадах, конференціях, соціальних акціях, присвячених Дню Європи («Відкрий Європу для себе, відкрий Європу в собі»), 85-річчю парка культури і відпочинку ім. М.Горького «Парк – серце міста», Дню толерантності «Всі ми різні, всі ми разом».\n"
                + "\n"
                + "Кафедра має практичний досвід співпраці з такими зарубіжними партнерами, як Центр етики та дослідження бідності Університету Зальцбурга (Зальцбург, Австрія), Інститут соціально-політичних досліджень Російської Академії Наук (Москва, Росія), Науково-координаційна рада з міжнародних досліджень Московського державного інституту міжнародних відносин (університету,) Міністерства закордонних справ Російської Федерації (Москва, Росія)."),
        new Kafedra("Кафедра економіки",
            "Кафедра економіки заснована в 2007 році в результаті поділу кафедри економіки і менеджменту, яка на той час була випускаючою для двох спеціальностей «Економічна кібернетика» та «Менеджмент організацій».\n"
                + "\n"
                + "Засновником і першим завідувачем, сьогодні вже кафедри економіки, є кандидат економічних наук, професор Дергаль Анатолій Васильович.\n"
                + "\n"
                + "Значний вклад в розвиток наукової роботи студентів зробила завідувач кафедри (2006-2012 рр.), кандидат економічних наук, доцент Леушина Олена Анатоліївна.\n"
                + "\n"
                + "З 2013 року на посаду завідувача кафедри економіки призначено кандидата економічних наук, доцента Петренко Володимира Андрійовича.\n"
                + "\n"
                + "Сьогодні кафедра економіки в складі факультету інформатики, математики та економіки, веде підготовку студентів за спеціальностями «Економічна кібернетика» і «Економіка підприємств» (форми навчання: державна, контрактна).\n"
                + "\n"
                + "Кафедра забезпечує викладання дисциплін «Економіка», «Економічна теорія», «Макроекономіка», «Мікроекономіка» та інші, що входять до навчальних планів багатьох спеціальностей університету.\n"
                + "\n"
                + "Освітньо-кваліфікаційний рівень: бакалавр Напрям: 0305 «Економіка та підприємництво» Спеціальність:6.030502 «Економічна кібернетика»"),
        new Kafedra("Кафедра менеджменту  і туристичної індустрії",
            "1 вересня 2004 року у складі економічного факультету Мелітопольського державного педагогічного університету була заснована кафедра економіки і менеджменту.\n"
                + "\n"
                + "У 2007 році кафедра менеджменту і туристичної індустрії була реорганізована та відокремилася як самостійний підрозділ. З 2007 року кафедру очолює кандидат географічних наук, доцент  Донченко Л. М.  Лариса Михайлівна у  1994 році закінчила Мелітопольський державний педагогічний інститут, а в 2007 році  магістратуру Гуманітарного університету «Запорізького інституту державного та муніципального управління» за спеціальністю «Адміністративний менеджмент».  У 2002 році захистила  дисертацію за темою «Територіальна організація приморської рекреаційної системи розселення на прикладі Запорізького Приазов’я» та отримала вчене звання кандидата наук. Керує дипломними та бакалаврськими роботами, які мають високий рівень підготовки. У Мелітопольському державному педагогічному університеті працює з 1988 року, загальний стаж педагогічної роботи понад 20 років.\n"
                + "\n"
                //  + "На цей час на кафедрі працюють: завідувач кафедри, кандидат географічних наук, доцент Донченко Л.М., кандидат економічних наук, доцент Олексенко Р.І., кандидат економічних наук, доцент Адаменко В.К., кандидат економічних наук, доцент Стецишин М.М., старший викладач Щебликіна З.В., кандидат юридичних наук, асистент Дащенко О.В., асистент Рибальченко Н.П. Технічно-допоміжний персонал кафедри: лаборант Ковалевська М.В., інженер Кулєшов С.О.\n"
                + "\n"
                + "Кафедра здійснює підготовку студентів  за напрямом підготовки 6.030601 Менеджмент (ОКР «Бакалавр») та спеціальності 7.03060101 Менеджмент організацій і адміністрування (ОКР «Спеціаліст»).\n"
                + "\n"
                + "Навчальна, виховна та науково-дослідна робота кафедри спрямована на забезпечення фахівців спеціальності «Менеджмент» потенціалом новітніх управлінських технологій для широкого вибору конкретних напрямків практичної діяльності за фахом, на розвиток вмінь самостійно та кваліфіковано вирішувати комплекс завдань відповідно до їх функціональних обов’язків.\n"
                + "\n"
                + "Кафедра  менеджменту і туристичної індустрії проводить свою роботу у рамках кафедральної теми «Сучасні тенденції розвитку соціально-економічного потенціалу Запорізької області та суміжних територій».\n"
                + "\n"
                + "Здійснюється співпраця кафедри з науковцями Одеського Національного університету імені  І.І. Мечникова (місто Одеса), Національного педагогічного університету імені М.П. Драгоманова (місто Київ), Національного університету імені Т.Г. Шевченко (місто Київ), Київського національного торгово-економічного університету (місто Київ),   Національним музеєм народної архітектури та побуту України, Рязанського інституту управління та права (місто Рязань, Росія).\n"
                + "\n"
                + "У листопаді 2012 року була підписана угода про наукове співробітництво та проведення практик студентів з Національним музеєм народної архітектури та побуту України.\n"
                + "\n"
                + "Викладачі кафедри є членами міжкафедральної лабораторії рекреаційних досліджень. У межах проекту «Мелітополь туристичний» підписано договір про співпрацю лабораторії з відділом управління культури та відділом стратегічного розвитку міста Виконавчого комітету Мелітопольської міської ради.\n"
                + "\n"
                + "На кафедрі продовжує роботу науковий студентський гурток «Менеджер». До наукової діяльності залучаються студенти напряму підготовки  «Менеджмент» та спеціальності «Менеджмент організацій і адміністрування», які розробляють індивідуальні науково-дослідні робити згідно пріоритетних напрямків досліджень кафедри.\n"
                + "\n"
                + "Підсумками досліджень стає участь студентів у науково-практичних конференціях, написання курсових, бакалаврських та дипломних робіт, які охоплюють певний аспект досліджуваної проблеми.\n"
                + "\n"
                + "Особлива увага на кафедрі приділяється налагодженню та підтримці широкого кола ділових зв’язків з науковими, освітніми, підприємницькими та громадськими установами як в межах України, так і в інших країнах.\n"
                + "\n"
                + "Кафедра продовжує наукове співробітництво з Рязанським інститутом управління і права (місто Рязань, Росія).\n"
                + "\n"
                + "В рамках договорів викладачі кафедри менеджменту і туристичної індустрії активно приймають участь у науково-практичних конференціях, семінарах з актуальних проблем економіки, управління та туризму; рецензують монографії, навчально-методичні посібники, програми дисциплін вищої школи, методичні рекомендації; здійснюють обмін інформацією щодо досвіду впровадження кредитно-модульної системи організації учбового процесу в університетах згідно вимогам Болонського процесу.\n"
                + "\n"
                + "Доцент Олексенко Р.І. включений до редакційної колегії  наукового журналу «Новий Університет» (Росія).\n"
                + "\n"
                + "Також, кафедрою менеджменту і туристичної індустрії ведуться переговори з Московськими Вишами, що мають спеціальності відповідного профілю, такими як: МФЮА (Московский финансово-юридический университет), МЭСИ (Московский Государственный университет экономики, статистики и информатики), МГИИТ (Московский государственный институт индустрии и туризма), Институт гостиничного и туристического менеджмента (Росія).\n"
                + "\n"
                + "Контакти:\n"
                + "\n"
                + "72312, Запорізька область, місто Мелітополь, вулиця Дзержинського, 68\n"
                + "\n"
                + "тел. (0619) 44-04-67\n"
                + "\n"
                + "e-mail: menedgment@mdpu.org.ua\n"
                + "menedzhment2007@mail.ru"),
        new Kafedra("Кафедра прикладної математики  та інформаційних технологій",
            "Кафедра прикладної математики та інформаційних технологій створена в 2014 році рішенням Вченої ради Мелітопольського державного педагогічного університету імені Богдана Хмельницького.\n"
                + "\n"
                + "Очолив кафедру доктор технічних наук, професор, академік АНВО А.В. Найдиш. Андрій Володимирович є членом спеціалізованої вченої ради Д26.056.06 по захисту докторських дисертацій за спеціальністю 05.01.01 – Прикладна геометрія, інженерна графіка (КНУБА, м. Київ), очолює Мелітопольську наукову школу прикладної геометрії, член та співголова оргкомітету щорічної Міжнародної науково-практичної конференції «Сучасні проблеми  геометричного моделювання», член оргкомітету та журі Всеукраїнського конкурсу МОН студентських наукових робіт з прикладної геометрії (м. Харків, НТУУ «ХПІ»), працює у складі оргкомітету республіканського науково-практичного семінару з прикладної геометрії (КНУБА, м. Київ), очолює роботу міжвузівського науково-практичного семінару з прикладної геометрії, обраний членом президії та віце-президентом Всеукраїнської асоціації з прикладної геометрії. Найдиш А.В. є співавтором 2 навчальних посібників з грифом МОН, 2 електронних навчальних посібників. Має 268 науково-методичних публікації. Під його керівництвом захищено 7 кандидатських та 1 докторська дисертації. Був членом оргкомітету та виступав з доповідями на міжнародних науково-практичних конференціях (Донецьк, Київ, Львів, Мелітополь, Одеса, Харків, Херсон), приймав участь у Х Всесвітньому конгресі геометрів (м. Київ).\n"
                + "\n"
                + "Навчально-виховний процес та наукову роботу на кафедрі здійснюють 2 професори, 4 доценти, 1 асистент та 1 викладач-стажист, кваліфікація яких відповідає зайнятим посадам, задовольняє вимогам навчально-методичної, організаційної, виховної роботи, сприяє розв’язанню освітньо-культурних і наукових проблем. На кафедрі викладаються дисципліни з напрямів: інформатика, нові інформаційні технології, програмування.\n"
                + "\n"
                + "При кафедрі прикладної математики та інформаційних технологій діє аспірантура зі спеціальності 05.01.01 – Прикладна геометрія, інженерна графіка.\n"
                + "\n"
                + "Викладачі кафедри беруть активну участь у наукових конференціях та семінарах. Протягом року при кафедрі діє міжрегіональний науково-практичний семінар «Сучасні проблеми геометричного моделювання» під керівництвом професора Найдиш А.В., на якому доповідаються проміжні та кінцеві результати наукових та дисертаційних досліджень (керівник академік). Кафедра є опорною для проведення щорічної Міжнародної науково-практичної конференції «Сучасні проблеми геометричного моделювання», у якій беруть участь щорічно понад 100 учасників.\n"
                + "\n"
                + "Кафедра прикладної математики та інформаційних технологій підтримує плідні науково-методичні зв’язки з провідними ВНЗ України, СНД та зарубіжжя і працює за такими напрямами наукових досліджень:\n"
                + "\n"
                + "- розробка теоретичних основ варіативного дискретного геометричного моделювання;\n"
                + "\n"
                + "- розробка методики формування дискретних геометричних моделей на основі точкових рядів та масивів;\n"
                + "\n"
                + "- розробка методики формування дискретних геометричних моделей на основі просторових кутових параметрів;\n"
                + "\n"
                + "- розробка способів дискретного геометричного моделювання одновимірних обводів по заданому закону зміни диференціально-геометричних характеристик;\n"
                + "\n"
                + "- розробка методики формалізації елементарних двовимірних геометричних побудов на базі апарату БН – числення.\n"
                + "\n"
                + "Кафедра прикладної математики та інформаційних технологій знаходиться на IІ поверсі навчального корпусу № 1, аудиторія 19.\n"
                + "\n"
                + "Контактна адреса: 72312, вул. Леніна 20, м. Мелітополь, Запорізька обл."));
  }

}
